In [208]:
import pandas as pd

In [209]:
pd.Timestamp('2021-10-21')

Timestamp('2021-10-21 00:00:00')

In [210]:
def display_timestamp(input_text: str):
    print(pd.Timestamp(input_text))

In [211]:
display_timestamp('2021-10-21')
display_timestamp('2021.12.01')
display_timestamp('2021/10/21')
display_timestamp('2021 Nov 01')

2021-10-21 00:00:00
2021-12-01 00:00:00
2021-10-21 00:00:00
2021-11-01 00:00:00

In [212]:
pd.Timestamp(168234198939812398)

Timestamp('1975-05-02 03:43:18.939812398')

In [213]:
pd.Timestamp(1781231098.12312, unit='s')

Timestamp('2026-06-12 02:24:58.123120070')

In [214]:
pd.Timestamp(2024, 12, 30, 10, 10, 10)

Timestamp('2024-12-30 10:10:10')

In [215]:
pd.Timestamp(year=2023, month=12, day=15, hour=4, minute=55, second=20)

Timestamp('2023-12-15 04:55:20')

In [216]:
def display_result(input_text: str):
    print(pd.to_datetime(input_text))

In [217]:
display_result('2024-12-22')
display_result(1987235248324235)

2024-12-22 00:00:00
1970-01-24 00:00:35.248324235

In [218]:
pd.to_datetime(['2021-10-12', '2022-11-11'])

DatetimeIndex(['2021-10-12', '2022-11-11'], dtype='datetime64[ns]', freq=None)

In [219]:
pd.to_datetime([19876567891, '2021.10.12', '2000'])

DatetimeIndex(['1970-01-01 00:00:19.876567891', '2021-10-12 00:00:00',
               '2000-01-01 00:00:00'],
              dtype='datetime64[ns]', freq=None)

In [220]:
pd.to_datetime(['1997', '2021.10.12'], errors='coerce') # invalid date format raise error, avoid coerce

DatetimeIndex(['1997-01-01', 'NaT'], dtype='datetime64[ns]', freq=None)

In [221]:
pd.date_range(start='2024-01-01', end='2024-12-31')

DatetimeIndex(['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04',
               '2024-01-05', '2024-01-06', '2024-01-07', '2024-01-08',
               '2024-01-09', '2024-01-10',
               ...
               '2024-12-22', '2024-12-23', '2024-12-24', '2024-12-25',
               '2024-12-26', '2024-12-27', '2024-12-28', '2024-12-29',
               '2024-12-30', '2024-12-31'],
              dtype='datetime64[ns]', length=366, freq='D')

In [222]:
pd.date_range(start='2024-01-01', end='2024-12-31', freq='M')

C:\Users\maniu\AppData\Local\Temp\ipykernel_18192\1715600590.py:1: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  pd.date_range(start='2024-01-01', end='2024-12-31', freq='M')

DatetimeIndex(['2024-01-31', '2024-02-29', '2024-03-31', '2024-04-30',
               '2024-05-31', '2024-06-30', '2024-07-31', '2024-08-31',
               '2024-09-30', '2024-10-31', '2024-11-30', '2024-12-31'],
              dtype='datetime64[ns]', freq='ME')

In [223]:
pd.date_range(start='2024-01-01', end='2024-12-31', freq='MS')

DatetimeIndex(['2024-01-01', '2024-02-01', '2024-03-01', '2024-04-01',
               '2024-05-01', '2024-06-01', '2024-07-01', '2024-08-01',
               '2024-09-01', '2024-10-01', '2024-11-01', '2024-12-01'],
              dtype='datetime64[ns]', freq='MS')

In [224]:
pd.date_range(start='2024-01-01', end='2024-12-31', periods=12)

DatetimeIndex([          '2024-01-01 00:00:00',
               '2024-02-03 04:21:49.090909091',
               '2024-03-07 08:43:38.181818182',
               '2024-04-09 13:05:27.272727273',
               '2024-05-12 17:27:16.363636364',
               '2024-06-14 21:49:05.454545456',
               '2024-07-18 02:10:54.545454546',
               '2024-08-20 06:32:43.636363636',
               '2024-09-22 10:54:32.727272728',
               '2024-10-25 15:16:21.818181820',
               '2024-11-27 19:38:10.909090912',
                         '2024-12-31 00:00:00'],
              dtype='datetime64[ns]', freq=None)

In [225]:
pd.date_range(start='2024-01-01', periods=20)

DatetimeIndex(['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04',
               '2024-01-05', '2024-01-06', '2024-01-07', '2024-01-08',
               '2024-01-09', '2024-01-10', '2024-01-11', '2024-01-12',
               '2024-01-13', '2024-01-14', '2024-01-15', '2024-01-16',
               '2024-01-17', '2024-01-18', '2024-01-19', '2024-01-20'],
              dtype='datetime64[ns]', freq='D')

In [226]:
pd.date_range(end='2024-12-31', periods=12)

DatetimeIndex(['2024-12-20', '2024-12-21', '2024-12-22', '2024-12-23',
               '2024-12-24', '2024-12-25', '2024-12-26', '2024-12-27',
               '2024-12-28', '2024-12-29', '2024-12-30', '2024-12-31'],
              dtype='datetime64[ns]', freq='D')

In [227]:
pd.date_range(start='2024-01-01', end='2024-12-31', freq='M')

C:\Users\maniu\AppData\Local\Temp\ipykernel_18192\1715600590.py:1: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  pd.date_range(start='2024-01-01', end='2024-12-31', freq='M')

DatetimeIndex(['2024-01-31', '2024-02-29', '2024-03-31', '2024-04-30',
               '2024-05-31', '2024-06-30', '2024-07-31', '2024-08-31',
               '2024-09-30', '2024-10-31', '2024-11-30', '2024-12-31'],
              dtype='datetime64[ns]', freq='ME')

In [228]:
pd.date_range(periods=20, end='2024-12-31', freq='M')

C:\Users\maniu\AppData\Local\Temp\ipykernel_18192\135927532.py:1: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  pd.date_range(periods=20, end='2024-12-31', freq='M')

DatetimeIndex(['2023-05-31', '2023-06-30', '2023-07-31', '2023-08-31',
               '2023-09-30', '2023-10-31', '2023-11-30', '2023-12-31',
               '2024-01-31', '2024-02-29', '2024-03-31', '2024-04-30',
               '2024-05-31', '2024-06-30', '2024-07-31', '2024-08-31',
               '2024-09-30', '2024-10-31', '2024-11-30', '2024-12-31'],
              dtype='datetime64[ns]', freq='ME')

In [229]:
pd.date_range(periods=5, end='2024-12-31', freq='N')

C:\Users\maniu\AppData\Local\Temp\ipykernel_18192\1996025427.py:1: FutureWarning: 'N' is deprecated and will be removed in a future version, please use 'ns' instead.
  pd.date_range(periods=5, end='2024-12-31', freq='N')

DatetimeIndex(['2024-12-30 23:59:59.999999996',
               '2024-12-30 23:59:59.999999997',
               '2024-12-30 23:59:59.999999998',
               '2024-12-30 23:59:59.999999999',
                         '2024-12-31 00:00:00'],
              dtype='datetime64[ns]', freq='ns')

In [230]:
pd.date_range(start='2024-01-01', end='2024-12-31', freq='QS')

DatetimeIndex(['2024-01-01', '2024-04-01', '2024-07-01', '2024-10-01'], dtype='datetime64[ns]', freq='QS-JAN')

In [231]:
start_time = pd.Timestamp('2022-10-22 10:00')
end_time = pd.Timestamp('2022-10-22 10:03')
elapse_time = end_time - start_time
elapse_time

Timedelta('0 days 00:03:00')

In [232]:
def display_time(input_text: str):
    print(pd.Timedelta(input_text))

In [233]:
display_time('2 days')
display_time('2 days 21 hr 4s')
display_time('2 days 4 hours 30 minutes 4seconds')
display_time('1W 2D')
pd.TimedeltaIndex(['2d 21 hr 4s', '3 days', '4 hours 50 seconds'])

2 days 00:00:00
2 days 21:00:04
2 days 04:30:04
9 days 00:00:00

TimedeltaIndex(['2 days 21:00:04', '3 days 00:00:00', '0 days 04:00:50'], dtype='timedelta64[ns]', freq=None)

In [234]:
pd.timedelta_range(start='1 day', periods=12)

TimedeltaIndex([ '1 days',  '2 days',  '3 days',  '4 days',  '5 days',
                 '6 days',  '7 days',  '8 days',  '9 days', '10 days',
                '11 days', '12 days'],
               dtype='timedelta64[ns]', freq='D')

In [235]:
pd.timedelta_range(start='1 day', periods=3, closed='left')

TimedeltaIndex(['1 days', '2 days'], dtype='timedelta64[ns]', freq='D')

In [236]:
pd.timedelta_range(start='1 day', periods=3, closed='right')

TimedeltaIndex(['2 days', '3 days'], dtype='timedelta64[ns]', freq='D')

In [237]:
pd.timedelta_range(start='1 day', periods=3, freq='2D')

TimedeltaIndex(['1 days', '3 days', '5 days'], dtype='timedelta64[ns]', freq='2D')

In [238]:
pd.timedelta_range(start='1 day',  periods=3, end='10 days' )

TimedeltaIndex(['1 days 00:00:00', '5 days 12:00:00', '10 days 00:00:00'], dtype='timedelta64[ns]', freq=None)

In [239]:
pd.timedelta_range(start='1 day',  periods=3, end='10 days' )

TimedeltaIndex(['1 days 00:00:00', '5 days 12:00:00', '10 days 00:00:00'], dtype='timedelta64[ns]', freq=None)

In [240]:
one_week = pd.date_range(start='21/12/2024', end='27/12/2024')
one_week

DatetimeIndex(['2024-12-21', '2024-12-22', '2024-12-23', '2024-12-24',
               '2024-12-25', '2024-12-26', '2024-12-27'],
              dtype='datetime64[ns]', freq='D')

In [241]:
one_week_df = pd.Series(one_week).to_frame('Dates')
one_week_df

       Dates
0 2024-12-21
1 2024-12-22
2 2024-12-23
3 2024-12-24
4 2024-12-25
5 2024-12-26
6 2024-12-27

In [242]:
one_week_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Dates   7 non-null      datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 188.0 bytes

can access attributes by dt. like month, year, day

In [243]:
one_week_df['Dates'].dt.day

0    21
1    22
2    23
3    24
4    25
5    26
6    27
Name: Dates, dtype: int32

In [244]:
one_week_df['Dates'].dt.month

0    12
1    12
2    12
3    12
4    12
5    12
6    12
Name: Dates, dtype: int32

In [245]:
one_week_df['Dates'].dt.year

0    2024
1    2024
2    2024
3    2024
4    2024
5    2024
6    2024
Name: Dates, dtype: int32

In [246]:
one_week_df['Dates'].dt.day_name()

0     Saturday
1       Sunday
2       Monday
3      Tuesday
4    Wednesday
5     Thursday
6       Friday
Name: Dates, dtype: object

In [247]:
one_week_df['Dates'].dt.to_period()

0    2024-12-21
1    2024-12-22
2    2024-12-23
3    2024-12-24
4    2024-12-25
5    2024-12-26
6    2024-12-27
Name: Dates, dtype: period[D]

In [248]:
twelve_months= pd.date_range(start='2024-01', end='2024-12', freq='MS')
df = pd.Series(data='something', index=twelve_months).to_frame('Data')
df

                 Data
2024-01-01  something
2024-02-01  something
2024-03-01  something
2024-04-01  something
2024-05-01  something
2024-06-01  something
2024-07-01  something
2024-08-01  something
2024-09-01  something
2024-10-01  something
2024-11-01  something
2024-12-01  something

In [249]:
ts = df.index[0]
ts.month_name()

'January'

In [250]:
ts.day_name()

'Monday'

In [251]:
ts.year

2024

In [252]:
ts.days_in_month

31

In [253]:
ts.day_of_week

0

In [254]:
ts.dayofyear

1

In [255]:
df.index.month_name()

Index(['January', 'February', 'March', 'April', 'May', 'June', 'July',
       'August', 'September', 'October', 'November', 'December'],
      dtype='object')

In [256]:
df['Month'] = df.index.month_name()
df

                 Data      Month
2024-01-01  something    January
2024-02-01  something   February
2024-03-01  something      March
2024-04-01  something      April
2024-05-01  something        May
2024-06-01  something       June
2024-07-01  something       July
2024-08-01  something     August
2024-09-01  something  September
2024-10-01  something    October
2024-11-01  something   November
2024-12-01  something   December

In [257]:
df['Dates'] = df.index
df

                 Data      Month      Dates
2024-01-01  something    January 2024-01-01
2024-02-01  something   February 2024-02-01
2024-03-01  something      March 2024-03-01
2024-04-01  something      April 2024-04-01
2024-05-01  something        May 2024-05-01
2024-06-01  something       June 2024-06-01
2024-07-01  something       July 2024-07-01
2024-08-01  something     August 2024-08-01
2024-09-01  something  September 2024-09-01
2024-10-01  something    October 2024-10-01
2024-11-01  something   November 2024-11-01
2024-12-01  something   December 2024-12-01

In [258]:
df['Dates'].dt.day_name()

2024-01-01       Monday
2024-02-01     Thursday
2024-03-01       Friday
2024-04-01       Monday
2024-05-01    Wednesday
2024-06-01     Saturday
2024-07-01       Monday
2024-08-01     Thursday
2024-09-01       Sunday
2024-10-01      Tuesday
2024-11-01       Friday
2024-12-01       Sunday
Freq: MS, Name: Dates, dtype: object

In [259]:
df['Days'] = df['Dates'].dt.day_name()
df

                 Data      Month      Dates       Days
2024-01-01  something    January 2024-01-01     Monday
2024-02-01  something   February 2024-02-01   Thursday
2024-03-01  something      March 2024-03-01     Friday
2024-04-01  something      April 2024-04-01     Monday
2024-05-01  something        May 2024-05-01  Wednesday
2024-06-01  something       June 2024-06-01   Saturday
2024-07-01  something       July 2024-07-01     Monday
2024-08-01  something     August 2024-08-01   Thursday
2024-09-01  something  September 2024-09-01     Sunday
2024-10-01  something    October 2024-10-01    Tuesday
2024-11-01  something   November 2024-11-01     Friday
2024-12-01  something   December 2024-12-01     Sunday

In [260]:
cols = ['date', 'high', 'low', 'open', 'close']
apple_stocks = pd.read_csv('AAPL.csv', usecols=cols)
apple_stocks

                           date    close     high       low    open
0     2015-05-27 00:00:00+00:00  132.045  132.260  130.0500  130.34
1     2015-05-28 00:00:00+00:00  131.780  131.950  131.1000  131.86
2     2015-05-29 00:00:00+00:00  130.280  131.450  129.9000  131.23
3     2015-06-01 00:00:00+00:00  130.535  131.390  130.0500  131.20
4     2015-06-02 00:00:00+00:00  129.960  130.655  129.3200  129.86
...                         ...      ...      ...       ...     ...
1253  2020-05-18 00:00:00+00:00  314.960  316.500  310.3241  313.17
1254  2020-05-19 00:00:00+00:00  313.140  318.520  313.0100  315.03
1255  2020-05-20 00:00:00+00:00  319.230  319.520  316.2000  316.68
1256  2020-05-21 00:00:00+00:00  316.850  320.890  315.8700  318.66
1257  2020-05-22 00:00:00+00:00  318.890  319.230  315.3500  315.77

[1258 rows x 5 columns]

In [261]:
apple_stocks.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1258 entries, 0 to 1257
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1258 non-null   object
 1   close   1258 non-null   float64
 2   high    1258 non-null   float64
 3   low     1258 non-null   float64
 4   open    1258 non-null   float64
dtypes: float64(4), object(1)
memory usage: 49.3+ KB

In [262]:
apple_stocks.set_index('date', inplace=True)

In [263]:
apple_stocks.index

Index(['2015-05-27 00:00:00+00:00', '2015-05-28 00:00:00+00:00',
       '2015-05-29 00:00:00+00:00', '2015-06-01 00:00:00+00:00',
       '2015-06-02 00:00:00+00:00', '2015-06-03 00:00:00+00:00',
       '2015-06-04 00:00:00+00:00', '2015-06-05 00:00:00+00:00',
       '2015-06-08 00:00:00+00:00', '2015-06-09 00:00:00+00:00',
       ...
       '2020-05-11 00:00:00+00:00', '2020-05-12 00:00:00+00:00',
       '2020-05-13 00:00:00+00:00', '2020-05-14 00:00:00+00:00',
       '2020-05-15 00:00:00+00:00', '2020-05-18 00:00:00+00:00',
       '2020-05-19 00:00:00+00:00', '2020-05-20 00:00:00+00:00',
       '2020-05-21 00:00:00+00:00', '2020-05-22 00:00:00+00:00'],
      dtype='object', name='date', length=1258)

In [264]:
pd.to_datetime(apple_stocks.index)

DatetimeIndex(['2015-05-27 00:00:00+00:00', '2015-05-28 00:00:00+00:00',
               '2015-05-29 00:00:00+00:00', '2015-06-01 00:00:00+00:00',
               '2015-06-02 00:00:00+00:00', '2015-06-03 00:00:00+00:00',
               '2015-06-04 00:00:00+00:00', '2015-06-05 00:00:00+00:00',
               '2015-06-08 00:00:00+00:00', '2015-06-09 00:00:00+00:00',
               ...
               '2020-05-11 00:00:00+00:00', '2020-05-12 00:00:00+00:00',
               '2020-05-13 00:00:00+00:00', '2020-05-14 00:00:00+00:00',
               '2020-05-15 00:00:00+00:00', '2020-05-18 00:00:00+00:00',
               '2020-05-19 00:00:00+00:00', '2020-05-20 00:00:00+00:00',
               '2020-05-21 00:00:00+00:00', '2020-05-22 00:00:00+00:00'],
              dtype='datetime64[ns, UTC]', name='date', length=1258, freq=None)

In [265]:
apple_stocks = pd.read_csv('AAPL.csv', usecols=cols, parse_dates=['date'], index_col='date')
apple_stocks

                             close     high       low    open
date
2015-05-27 00:00:00+00:00  132.045  132.260  130.0500  130.34
2015-05-28 00:00:00+00:00  131.780  131.950  131.1000  131.86
2015-05-29 00:00:00+00:00  130.280  131.450  129.9000  131.23
2015-06-01 00:00:00+00:00  130.535  131.390  130.0500  131.20
2015-06-02 00:00:00+00:00  129.960  130.655  129.3200  129.86
...                            ...      ...       ...     ...
2020-05-18 00:00:00+00:00  314.960  316.500  310.3241  313.17
2020-05-19 00:00:00+00:00  313.140  318.520  313.0100  315.03
2020-05-20 00:00:00+00:00  319.230  319.520  316.2000  316.68
2020-05-21 00:00:00+00:00  316.850  320.890  315.8700  318.66
2020-05-22 00:00:00+00:00  318.890  319.230  315.3500  315.77

[1258 rows x 4 columns]

In [266]:
days = apple_stocks.index.day_name()
apple_stocks.insert(0, 'day', days)
apple_stocks

                                 day    close     high       low    open
date
2015-05-27 00:00:00+00:00  Wednesday  132.045  132.260  130.0500  130.34
2015-05-28 00:00:00+00:00   Thursday  131.780  131.950  131.1000  131.86
2015-05-29 00:00:00+00:00     Friday  130.280  131.450  129.9000  131.23
2015-06-01 00:00:00+00:00     Monday  130.535  131.390  130.0500  131.20
2015-06-02 00:00:00+00:00    Tuesday  129.960  130.655  129.3200  129.86
...                              ...      ...      ...       ...     ...
2020-05-18 00:00:00+00:00     Monday  314.960  316.500  310.3241  313.17
2020-05-19 00:00:00+00:00    Tuesday  313.140  318.520  313.0100  315.03
2020-05-20 00:00:00+00:00  Wednesday  319.230  319.520  316.2000  316.68
2020-05-21 00:00:00+00:00   Thursday  316.850  320.890  315.8700  318.66
2020-05-22 00:00:00+00:00     Friday  318.890  319.230  315.3500  315.77

[1258 rows x 5 columns]

In [267]:
apple_stocks.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 1258 entries, 2015-05-27 00:00:00+00:00 to 2020-05-22 00:00:00+00:00
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   day     1258 non-null   object
 1   close   1258 non-null   float64
 2   high    1258 non-null   float64
 3   low     1258 non-null   float64
 4   open    1258 non-null   float64
dtypes: float64(4), object(1)
memory usage: 59.0+ KB

In [268]:
apple_stocks = pd.read_csv('AAPL.csv', usecols=cols, parse_dates=['date'])
apple_stocks.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1258 entries, 0 to 1257
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1258 non-null   datetime64[ns, UTC]
 1   close   1258 non-null   float64
 2   high    1258 non-null   float64
 3   low     1258 non-null   float64
 4   open    1258 non-null   float64
dtypes: datetime64[ns, UTC](1), float64(4)
memory usage: 49.3 KB

In [269]:
date = pd.to_datetime(apple_stocks['date'])
new_format = date.dt.strftime('%d.%m.%Y__%H:%M__%p')
new_format

0       27.05.2015__00:00__AM
1       28.05.2015__00:00__AM
2       29.05.2015__00:00__AM
3       01.06.2015__00:00__AM
4       02.06.2015__00:00__AM
                ...
1253    18.05.2020__00:00__AM
1254    19.05.2020__00:00__AM
1255    20.05.2020__00:00__AM
1256    21.05.2020__00:00__AM
1257    22.05.2020__00:00__AM
Name: date, Length: 1258, dtype: object

In [270]:
apple_stocks.set_index(new_format, inplace=True)
apple_stocks.drop(columns='date', inplace=True)
apple_stocks

                         close     high       low    open
date
27.05.2015__00:00__AM  132.045  132.260  130.0500  130.34
28.05.2015__00:00__AM  131.780  131.950  131.1000  131.86
29.05.2015__00:00__AM  130.280  131.450  129.9000  131.23
01.06.2015__00:00__AM  130.535  131.390  130.0500  131.20
02.06.2015__00:00__AM  129.960  130.655  129.3200  129.86
...                        ...      ...       ...     ...
18.05.2020__00:00__AM  314.960  316.500  310.3241  313.17
19.05.2020__00:00__AM  313.140  318.520  313.0100  315.03
20.05.2020__00:00__AM  319.230  319.520  316.2000  316.68
21.05.2020__00:00__AM  316.850  320.890  315.8700  318.66
22.05.2020__00:00__AM  318.890  319.230  315.3500  315.77

[1258 rows x 4 columns]

In [271]:
apple_stocks.to_csv('bad_apple.csv')

In [272]:
bad_apple = pd.read_csv('bad_apple.csv', parse_dates=['date'])
bad_apple

C:\Users\maniu\AppData\Local\Temp\ipykernel_18192\882307715.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  bad_apple = pd.read_csv('bad_apple.csv', parse_dates=['date'])

                       date    close     high       low    open
0     27.05.2015__00:00__AM  132.045  132.260  130.0500  130.34
1     28.05.2015__00:00__AM  131.780  131.950  131.1000  131.86
2     29.05.2015__00:00__AM  130.280  131.450  129.9000  131.23
3     01.06.2015__00:00__AM  130.535  131.390  130.0500  131.20
4     02.06.2015__00:00__AM  129.960  130.655  129.3200  129.86
...                     ...      ...      ...       ...     ...
1253  18.05.2020__00:00__AM  314.960  316.500  310.3241  313.17
1254  19.05.2020__00:00__AM  313.140  318.520  313.0100  315.03
1255  20.05.2020__00:00__AM  319.230  319.520  316.2000  316.68
1256  21.05.2020__00:00__AM  316.850  320.890  315.8700  318.66
1257  22.05.2020__00:00__AM  318.890  319.230  315.3500  315.77

[1258 rows x 5 columns]

In [273]:
pd.to_datetime(bad_apple['date']) # it won't work

C:\Users\maniu\AppData\Local\Temp\ipykernel_18192\2503795379.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  pd.to_datetime(bad_apple['date']) # it won't work

DateParseError: Unknown datetime string format, unable to parse: 27.05.2015__00:00__AM, at position 0

In [274]:
good_dates = pd.to_datetime(bad_apple['date'], format='%d.%m.%Y__%H:%M__%p')
good_dates

0      2015-05-27
1      2015-05-28
2      2015-05-29
3      2015-06-01
4      2015-06-02
          ...
1253   2020-05-18
1254   2020-05-19
1255   2020-05-20
1256   2020-05-21
1257   2020-05-22
Name: date, Length: 1258, dtype: datetime64[ns]

In [275]:
bad_apple.set_index(good_dates, inplace=True)
bad_apple.drop(columns='date', inplace=True)
bad_apple

              close     high       low    open
date
2015-05-27  132.045  132.260  130.0500  130.34
2015-05-28  131.780  131.950  131.1000  131.86
2015-05-29  130.280  131.450  129.9000  131.23
2015-06-01  130.535  131.390  130.0500  131.20
2015-06-02  129.960  130.655  129.3200  129.86
...             ...      ...       ...     ...
2020-05-18  314.960  316.500  310.3241  313.17
2020-05-19  313.140  318.520  313.0100  315.03
2020-05-20  319.230  319.520  316.2000  316.68
2020-05-21  316.850  320.890  315.8700  318.66
2020-05-22  318.890  319.230  315.3500  315.77

[1258 rows x 4 columns]

In [276]:
apple_stocks = pd.read_csv('AAPL.csv', usecols=cols, parse_dates=['date'], index_col='date')
apple_stocks

                             close     high       low    open
date
2015-05-27 00:00:00+00:00  132.045  132.260  130.0500  130.34
2015-05-28 00:00:00+00:00  131.780  131.950  131.1000  131.86
2015-05-29 00:00:00+00:00  130.280  131.450  129.9000  131.23
2015-06-01 00:00:00+00:00  130.535  131.390  130.0500  131.20
2015-06-02 00:00:00+00:00  129.960  130.655  129.3200  129.86
...                            ...      ...       ...     ...
2020-05-18 00:00:00+00:00  314.960  316.500  310.3241  313.17
2020-05-19 00:00:00+00:00  313.140  318.520  313.0100  315.03
2020-05-20 00:00:00+00:00  319.230  319.520  316.2000  316.68
2020-05-21 00:00:00+00:00  316.850  320.890  315.8700  318.66
2020-05-22 00:00:00+00:00  318.890  319.230  315.3500  315.77

[1258 rows x 4 columns]

In [277]:
apple_stocks.iloc[0]

close    132.045
high     132.260
low      130.050
open     130.340
Name: 2015-05-27 00:00:00+00:00, dtype: float64

In [278]:
apple_stocks.iloc[0:5]

                             close     high     low    open
date
2015-05-27 00:00:00+00:00  132.045  132.260  130.05  130.34
2015-05-28 00:00:00+00:00  131.780  131.950  131.10  131.86
2015-05-29 00:00:00+00:00  130.280  131.450  129.90  131.23
2015-06-01 00:00:00+00:00  130.535  131.390  130.05  131.20
2015-06-02 00:00:00+00:00  129.960  130.655  129.32  129.86

In [279]:
apple_stocks[:5]

                             close     high     low    open
date
2015-05-27 00:00:00+00:00  132.045  132.260  130.05  130.34
2015-05-28 00:00:00+00:00  131.780  131.950  131.10  131.86
2015-05-29 00:00:00+00:00  130.280  131.450  129.90  131.23
2015-06-01 00:00:00+00:00  130.535  131.390  130.05  131.20
2015-06-02 00:00:00+00:00  129.960  130.655  129.32  129.86

In [281]:
apple_stocks.loc['2015-06-02'] # even partial date format it retrieves

close    129.960
high     130.655
low      129.320
open     129.860
Name: 2015-06-02 00:00:00+00:00, dtype: float64

In [282]:
apple_stocks.loc['2015-05-27': '2015-05-29']

                             close    high     low    open
date
2015-05-27 00:00:00+00:00  132.045  132.26  130.05  130.34
2015-05-28 00:00:00+00:00  131.780  131.95  131.10  131.86
2015-05-29 00:00:00+00:00  130.280  131.45  129.90  131.23

In [284]:
apple_stocks.loc['2015-05']

                             close    high     low    open
date
2015-05-27 00:00:00+00:00  132.045  132.26  130.05  130.34
2015-05-28 00:00:00+00:00  131.780  131.95  131.10  131.86
2015-05-29 00:00:00+00:00  130.280  131.45  129.90  131.23

In [285]:
apple_stocks.loc[:'2015-07']

                             close      high       low     open
date
2015-05-27 00:00:00+00:00  132.045  132.2600  130.0500  130.340
2015-05-28 00:00:00+00:00  131.780  131.9500  131.1000  131.860
2015-05-29 00:00:00+00:00  130.280  131.4500  129.9000  131.230
2015-06-01 00:00:00+00:00  130.535  131.3900  130.0500  131.200
2015-06-02 00:00:00+00:00  129.960  130.6550  129.3200  129.860
2015-06-03 00:00:00+00:00  130.120  130.9400  129.9000  130.660
2015-06-04 00:00:00+00:00  129.360  130.5800  128.9100  129.580
2015-06-05 00:00:00+00:00  128.650  129.6900  128.3600  129.500
2015-06-08 00:00:00+00:00  127.800  129.2100  126.8300  128.900
2015-06-09 00:00:00+00:00  127.420  128.0800  125.6200  126.700
2015-06-10 00:00:00+00:00  128.880  129.3400  127.8500  127.920
2015-06-11 00:00:00+00:00  128.590  130.1800  128.4750  129.180
2015-06-12 00:00:00+00:00  127.170  128.3300  127.1100  128.185
2015-06-15 00:00:00+00:00  126.920  127.2400  125.7100  126.100
2015-06-16 00:00:00+00:00  127.600  127.8500  126.3700  127.030
2015-06-17 00:00:00+00:00  127.300  127.8800  126.7400  127.720
2015-06-18 00:00:00+00:00  127.880  128.3100  127.2200  127.230
2015-06-19 00:00:00+00:00  126.600  127.8200  126.4000  127.710
2015-06-22 00:00:00+00:00  127.610  128.0600  127.0800  127.490
2015-06-23 00:00:00+00:00  127.030  127.6100  126.8792  127.480
2015-06-24 00:00:00+00:00  128.110  129.8000  127.1200  127.210
2015-06-25 00:00:00+00:00  127.500  129.2000  127.5000  128.860
2015-06-26 00:00:00+00:00  126.750  127.9900  126.5100  127.670
2015-06-29 00:00:00+00:00  124.530  126.4700  124.4800  125.460
2015-06-30 00:00:00+00:00  125.425  126.1200  124.8600  125.570
2015-07-01 00:00:00+00:00  126.600  126.9400  125.9900  126.900
2015-07-02 00:00:00+00:00  126.440  126.6900  125.7700  126.430
2015-07-06 00:00:00+00:00  126.000  126.2300  124.8500  124.940
2015-07-07 00:00:00+00:00  125.690  126.1500  123.7700  125.890
2015-07-08 00:00:00+00:00  122.570  124.6400  122.5400  124.480
2015-07-09 00:00:00+00:00  120.070  124.0600  119.2200  123.850
2015-07-10 00:00:00+00:00  123.280  123.8500  121.2100  121.940
2015-07-13 00:00:00+00:00  125.660  125.7550  124.3200  125.030
2015-07-14 00:00:00+00:00  125.610  126.3700  125.0400  126.040
2015-07-15 00:00:00+00:00  126.820  127.1500  125.5800  125.720
2015-07-16 00:00:00+00:00  128.510  128.5700  127.3500  127.740
2015-07-17 00:00:00+00:00  129.620  129.6200  128.3100  129.080
2015-07-20 00:00:00+00:00  132.070  132.9700  130.7000  130.970
2015-07-21 00:00:00+00:00  130.750  132.9200  130.3200  132.850
2015-07-22 00:00:00+00:00  125.220  125.5000  121.9900  121.990
2015-07-23 00:00:00+00:00  125.160  127.0900  125.0600  126.200
2015-07-24 00:00:00+00:00  124.500  125.7400  123.9000  125.320
2015-07-27 00:00:00+00:00  122.770  123.6100  122.1200  123.090
2015-07-28 00:00:00+00:00  123.380  123.9100  122.5500  123.380
2015-07-29 00:00:00+00:00  122.990  123.5000  122.2700  123.150
2015-07-30 00:00:00+00:00  122.370  122.5699  121.7100  122.320
2015-07-31 00:00:00+00:00  121.300  122.6425  120.9100  122.600

In [286]:
apple_stocks.loc[['2015-05-27','2015-05-29']]

                             close    high     low    open
date
2015-05-27 00:00:00+00:00  132.045  132.26  130.05  130.34
2015-05-29 00:00:00+00:00  130.280  131.45  129.90  131.23

In [287]:
apple_stocks.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 1258 entries, 2015-05-27 00:00:00+00:00 to 2020-05-22 00:00:00+00:00
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   close   1258 non-null   float64
 1   high    1258 non-null   float64
 2   low     1258 non-null   float64
 3   open    1258 non-null   float64
dtypes: float64(4)
memory usage: 81.4 KB

In [288]:
apple_stocks.index.day_name().value_counts()

date
Wednesday    257
Tuesday      257
Thursday     255
Friday       253
Monday       236
Name: count, dtype: int64

In [289]:
max_date = apple_stocks.index.max()
max_date

Timestamp('2020-05-22 00:00:00+0000', tz='UTC')

In [290]:
min_date = apple_stocks.index.min()
min_date

Timestamp('2015-05-27 00:00:00+0000', tz='UTC')

In [291]:
date_incl_weekends = pd.date_range(start=min_date, end=max_date, freq='d')
date_incl_weekends

DatetimeIndex(['2015-05-27 00:00:00+00:00', '2015-05-28 00:00:00+00:00',
               '2015-05-29 00:00:00+00:00', '2015-05-30 00:00:00+00:00',
               '2015-05-31 00:00:00+00:00', '2015-06-01 00:00:00+00:00',
               '2015-06-02 00:00:00+00:00', '2015-06-03 00:00:00+00:00',
               '2015-06-04 00:00:00+00:00', '2015-06-05 00:00:00+00:00',
               ...
               '2020-05-13 00:00:00+00:00', '2020-05-14 00:00:00+00:00',
               '2020-05-15 00:00:00+00:00', '2020-05-16 00:00:00+00:00',
               '2020-05-17 00:00:00+00:00', '2020-05-18 00:00:00+00:00',
               '2020-05-19 00:00:00+00:00', '2020-05-20 00:00:00+00:00',
               '2020-05-21 00:00:00+00:00', '2020-05-22 00:00:00+00:00'],
              dtype='datetime64[ns, UTC]', length=1823, freq='D')

In [292]:
date_incl_weekends.day_name().value_counts()

Wednesday    261
Thursday     261
Friday       261
Saturday     260
Sunday       260
Monday       260
Tuesday      260
Name: count, dtype: int64

In [293]:
apple_stocks.reindex(date_incl_weekends).head(7)

                             close     high     low    open
2015-05-27 00:00:00+00:00  132.045  132.260  130.05  130.34
2015-05-28 00:00:00+00:00  131.780  131.950  131.10  131.86
2015-05-29 00:00:00+00:00  130.280  131.450  129.90  131.23
2015-05-30 00:00:00+00:00      NaN      NaN     NaN     NaN
2015-05-31 00:00:00+00:00      NaN      NaN     NaN     NaN
2015-06-01 00:00:00+00:00  130.535  131.390  130.05  131.20
2015-06-02 00:00:00+00:00  129.960  130.655  129.32  129.86

In [295]:
as2 = apple_stocks.reindex(date_incl_weekends, method='ffill')
as2['day'] = as2.index.day_name()
as2.head(7)

                             close     high     low    open        day
2015-05-27 00:00:00+00:00  132.045  132.260  130.05  130.34  Wednesday
2015-05-28 00:00:00+00:00  131.780  131.950  131.10  131.86   Thursday
2015-05-29 00:00:00+00:00  130.280  131.450  129.90  131.23     Friday
2015-05-30 00:00:00+00:00  130.280  131.450  129.90  131.23   Saturday
2015-05-31 00:00:00+00:00  130.280  131.450  129.90  131.23     Sunday
2015-06-01 00:00:00+00:00  130.535  131.390  130.05  131.20     Monday
2015-06-02 00:00:00+00:00  129.960  130.655  129.32  129.86    Tuesday

In [297]:
apple_stocks.head(7)

                             close     high     low    open
date
2015-05-27 00:00:00+00:00  132.045  132.260  130.05  130.34
2015-05-28 00:00:00+00:00  131.780  131.950  131.10  131.86
2015-05-29 00:00:00+00:00  130.280  131.450  129.90  131.23
2015-06-01 00:00:00+00:00  130.535  131.390  130.05  131.20
2015-06-02 00:00:00+00:00  129.960  130.655  129.32  129.86
2015-06-03 00:00:00+00:00  130.120  130.940  129.90  130.66
2015-06-04 00:00:00+00:00  129.360  130.580  128.91  129.58

In [299]:
apple_stocks = pd.read_csv('AAPL.csv', usecols=cols, parse_dates=['date'], index_col='date')
apple_stocks.head(7)

                             close     high     low    open
date
2015-05-27 00:00:00+00:00  132.045  132.260  130.05  130.34
2015-05-28 00:00:00+00:00  131.780  131.950  131.10  131.86
2015-05-29 00:00:00+00:00  130.280  131.450  129.90  131.23
2015-06-01 00:00:00+00:00  130.535  131.390  130.05  131.20
2015-06-02 00:00:00+00:00  129.960  130.655  129.32  129.86
2015-06-03 00:00:00+00:00  130.120  130.940  129.90  130.66
2015-06-04 00:00:00+00:00  129.360  130.580  128.91  129.58

In [304]:
months = apple_stocks.resample('MS')
months.groups

{Timestamp('2015-05-01 00:00:00+0000', tz='UTC'): 3,
 Timestamp('2015-06-01 00:00:00+0000', tz='UTC'): 25,
 Timestamp('2015-07-01 00:00:00+0000', tz='UTC'): 47,
 Timestamp('2015-08-01 00:00:00+0000', tz='UTC'): 68,
 Timestamp('2015-09-01 00:00:00+0000', tz='UTC'): 89,
 Timestamp('2015-10-01 00:00:00+0000', tz='UTC'): 111,
 Timestamp('2015-11-01 00:00:00+0000', tz='UTC'): 131,
 Timestamp('2015-12-01 00:00:00+0000', tz='UTC'): 153,
 Timestamp('2016-01-01 00:00:00+0000', tz='UTC'): 172,
 Timestamp('2016-02-01 00:00:00+0000', tz='UTC'): 192,
 Timestamp('2016-03-01 00:00:00+0000', tz='UTC'): 214,
 Timestamp('2016-04-01 00:00:00+0000', tz='UTC'): 235,
 Timestamp('2016-05-01 00:00:00+0000', tz='UTC'): 256,
 Timestamp('2016-06-01 00:00:00+0000', tz='UTC'): 278,
 Timestamp('2016-07-01 00:00:00+0000', tz='UTC'): 298,
 Timestamp('2016-08-01 00:00:00+0000', tz='UTC'): 321,
 Timestamp('2016-09-01 00:00:00+0000', tz='UTC'): 342,
 Timestamp('2016-10-01 00:00:00+0000', tz='UTC'): 363,
 Timestamp('2016-11-01 00:00:00+0000', tz='UTC'): 384,
 Timestamp('2016-12-01 00:00:00+0000', tz='UTC'): 405,
 Timestamp('2017-01-01 00:00:00+0000', tz='UTC'): 425,
 Timestamp('2017-02-01 00:00:00+0000', tz='UTC'): 444,
 Timestamp('2017-03-01 00:00:00+0000', tz='UTC'): 467,
 Timestamp('2017-04-01 00:00:00+0000', tz='UTC'): 486,
 Timestamp('2017-05-01 00:00:00+0000', tz='UTC'): 508,
 Timestamp('2017-06-01 00:00:00+0000', tz='UTC'): 530,
 Timestamp('2017-07-01 00:00:00+0000', tz='UTC'): 550,
 Timestamp('2017-08-01 00:00:00+0000', tz='UTC'): 573,
 Timestamp('2017-09-01 00:00:00+0000', tz='UTC'): 593,
 Timestamp('2017-10-01 00:00:00+0000', tz='UTC'): 615,
 Timestamp('2017-11-01 00:00:00+0000', tz='UTC'): 636,
 Timestamp('2017-12-01 00:00:00+0000', tz='UTC'): 656,
 Timestamp('2018-01-01 00:00:00+0000', tz='UTC'): 677,
 Timestamp('2018-02-01 00:00:00+0000', tz='UTC'): 696,
 Timestamp('2018-03-01 00:00:00+0000', tz='UTC'): 717,
 Timestamp('2018-04-01 00:00:00+0000', tz='UTC'): 738,
 Timestamp('2018-05-01 00:00:00+0000', tz='UTC'): 760,
 Timestamp('2018-06-01 00:00:00+0000', tz='UTC'): 781,
 Timestamp('2018-07-01 00:00:00+0000', tz='UTC'): 802,
 Timestamp('2018-08-01 00:00:00+0000', tz='UTC'): 825,
 Timestamp('2018-09-01 00:00:00+0000', tz='UTC'): 844,
 Timestamp('2018-10-01 00:00:00+0000', tz='UTC'): 867,
 Timestamp('2018-11-01 00:00:00+0000', tz='UTC'): 888,
 Timestamp('2018-12-01 00:00:00+0000', tz='UTC'): 907,
 Timestamp('2019-01-01 00:00:00+0000', tz='UTC'): 928,
 Timestamp('2019-02-01 00:00:00+0000', tz='UTC'): 947,
 Timestamp('2019-03-01 00:00:00+0000', tz='UTC'): 968,
 Timestamp('2019-04-01 00:00:00+0000', tz='UTC'): 989,
 Timestamp('2019-05-01 00:00:00+0000', tz='UTC'): 1011,
 Timestamp('2019-06-01 00:00:00+0000', tz='UTC'): 1031,
 Timestamp('2019-07-01 00:00:00+0000', tz='UTC'): 1053,
 Timestamp('2019-08-01 00:00:00+0000', tz='UTC'): 1075,
 Timestamp('2019-09-01 00:00:00+0000', tz='UTC'): 1095,
 Timestamp('2019-10-01 00:00:00+0000', tz='UTC'): 1118,
 Timestamp('2019-11-01 00:00:00+0000', tz='UTC'): 1138,
 Timestamp('2019-12-01 00:00:00+0000', tz='UTC'): 1159,
 Timestamp('2020-01-01 00:00:00+0000', tz='UTC'): 1180,
 Timestamp('2020-02-01 00:00:00+0000', tz='UTC'): 1199,
 Timestamp('2020-03-01 00:00:00+0000', tz='UTC'): 1221,
 Timestamp('2020-04-01 00:00:00+0000', tz='UTC'): 1242,
 Timestamp('2020-05-01 00:00:00+0000', tz='UTC'): 1258}

In [305]:
months.get_group('2016-01-01 00:00:00+0000')

                            close      high       low    open
date
2016-01-04 00:00:00+00:00  105.35  105.3680  102.0000  102.61
2016-01-05 00:00:00+00:00  102.71  105.8500  102.4100  105.75
2016-01-06 00:00:00+00:00  100.70  102.3700   99.8700  100.56
2016-01-07 00:00:00+00:00   96.45  100.1300   96.4300   98.68
2016-01-08 00:00:00+00:00   96.96   99.1100   96.7600   98.55
2016-01-11 00:00:00+00:00   98.53   99.0600   97.3400   98.97
2016-01-12 00:00:00+00:00   99.96  100.6900   98.8399  100.55
2016-01-13 00:00:00+00:00   97.39  101.1900   97.3000  100.32
2016-01-14 00:00:00+00:00   99.52  100.4800   95.7400   97.96
2016-01-15 00:00:00+00:00   97.13   97.7100   95.3600   96.20
2016-01-19 00:00:00+00:00   96.66   98.6500   95.5000   98.41
2016-01-20 00:00:00+00:00   96.79   98.1897   93.4200   95.10
2016-01-21 00:00:00+00:00   96.30   97.8800   94.9400   97.06
2016-01-22 00:00:00+00:00  101.42  101.4600   98.3700   98.63
2016-01-25 00:00:00+00:00   99.44  101.5300   99.2100  101.52
2016-01-26 00:00:00+00:00   99.99  100.8800   98.0700   99.93
2016-01-27 00:00:00+00:00   93.42   96.6289   93.3400   96.04
2016-01-28 00:00:00+00:00   94.09   94.5200   92.3900   93.79
2016-01-29 00:00:00+00:00   97.34   97.3400   94.3500   94.79

In [306]:
months.mean().round(2)

                            close    high     low    open
date
2015-05-01 00:00:00+00:00  131.37  131.89  130.35  131.14
2015-06-01 00:00:00+00:00  127.81  128.76  127.24  128.06
2015-07-01 00:00:00+00:00  125.34  126.20  124.34  125.45
2015-08-01 00:00:00+00:00  113.39  115.50  111.29  113.44
2015-09-01 00:00:00+00:00  112.80  114.21  111.52  113.00
...                           ...     ...     ...     ...
2020-01-01 00:00:00+00:00  311.92  314.33  308.83  311.17
2020-02-01 00:00:00+00:00  311.27  315.25  306.73  310.31
2020-03-01 00:00:00+00:00  262.44  269.69  254.85  261.07
2020-04-01 00:00:00+00:00  272.39  275.78  268.08  271.81
2020-05-01 00:00:00+00:00  308.04  311.09  304.10  306.38

[61 rows x 4 columns]

In [308]:
months2 = apple_stocks.resample('M', kind='period')
months2.groups

C:\Users\maniu\AppData\Local\Temp\ipykernel_18192\3266465949.py:1: FutureWarning: The 'kind' keyword in DataFrame.resample is deprecated and will be removed in a future version. Explicitly cast the index to the desired type instead
  months2 = apple_stocks.resample('M', kind='period')
C:\Users\maniu\AppData\Local\Temp\ipykernel_18192\3266465949.py:1: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  months2 = apple_stocks.resample('M', kind='period')

{Period('2015-05', 'M'): 3,
 Period('2015-06', 'M'): 25,
 Period('2015-07', 'M'): 47,
 Period('2015-08', 'M'): 68,
 Period('2015-09', 'M'): 89,
 Period('2015-10', 'M'): 111,
 Period('2015-11', 'M'): 131,
 Period('2015-12', 'M'): 153,
 Period('2016-01', 'M'): 172,
 Period('2016-02', 'M'): 192,
 Period('2016-03', 'M'): 214,
 Period('2016-04', 'M'): 235,
 Period('2016-05', 'M'): 256,
 Period('2016-06', 'M'): 278,
 Period('2016-07', 'M'): 298,
 Period('2016-08', 'M'): 321,
 Period('2016-09', 'M'): 342,
 Period('2016-10', 'M'): 363,
 Period('2016-11', 'M'): 384,
 Period('2016-12', 'M'): 405,
 Period('2017-01', 'M'): 425,
 Period('2017-02', 'M'): 444,
 Period('2017-03', 'M'): 467,
 Period('2017-04', 'M'): 486,
 Period('2017-05', 'M'): 508,
 Period('2017-06', 'M'): 530,
 Period('2017-07', 'M'): 550,
 Period('2017-08', 'M'): 573,
 Period('2017-09', 'M'): 593,
 Period('2017-10', 'M'): 615,
 Period('2017-11', 'M'): 636,
 Period('2017-12', 'M'): 656,
 Period('2018-01', 'M'): 677,
 Period('2018-02', 'M'): 696,
 Period('2018-03', 'M'): 717,
 Period('2018-04', 'M'): 738,
 Period('2018-05', 'M'): 760,
 Period('2018-06', 'M'): 781,
 Period('2018-07', 'M'): 802,
 Period('2018-08', 'M'): 825,
 Period('2018-09', 'M'): 844,
 Period('2018-10', 'M'): 867,
 Period('2018-11', 'M'): 888,
 Period('2018-12', 'M'): 907,
 Period('2019-01', 'M'): 928,
 Period('2019-02', 'M'): 947,
 Period('2019-03', 'M'): 968,
 Period('2019-04', 'M'): 989,
 Period('2019-05', 'M'): 1011,
 Period('2019-06', 'M'): 1031,
 Period('2019-07', 'M'): 1053,
 Period('2019-08', 'M'): 1075,
 Period('2019-09', 'M'): 1095,
 Period('2019-10', 'M'): 1118,
 Period('2019-11', 'M'): 1138,
 Period('2019-12', 'M'): 1159,
 Period('2020-01', 'M'): 1180,
 Period('2020-02', 'M'): 1199,
 Period('2020-03', 'M'): 1221,
 Period('2020-04', 'M'): 1242,
 Period('2020-05', 'M'): 1258}

In [309]:
months2.mean().round(2)

          close    high     low    open
date
2015-05  131.37  131.89  130.35  131.14
2015-06  127.81  128.76  127.24  128.06
2015-07  125.34  126.20  124.34  125.45
2015-08  113.39  115.50  111.29  113.44
2015-09  112.80  114.21  111.52  113.00
...         ...     ...     ...     ...
2020-01  311.92  314.33  308.83  311.17
2020-02  311.27  315.25  306.73  310.31
2020-03  262.44  269.69  254.85  261.07
2020-04  272.39  275.78  268.08  271.81
2020-05  308.04  311.09  304.10  306.38

[61 rows x 4 columns]

In [310]:
months2.agg({'high':['max','min'], 'low':['max','min']}).round(2)

           high             low
            max     min     max     min
date
2015-05  132.26  131.45  131.10  129.90
2015-06  131.39  126.12  130.05  124.48
2015-07  132.97  122.57  130.70  119.22
2015-08  122.57  108.80  117.52   92.00
2015-09  116.89  110.45  115.44  107.36
...         ...     ...     ...     ...
2020-01  327.85  299.96  321.38  292.75
2020-02  327.22  278.41  323.35  256.37
2020-03  304.00  228.50  293.13  212.61
2020-04  294.53  245.15  288.35  236.90
2020-05  320.89  293.69  316.20  285.85

[61 rows x 4 columns]

In [340]:
date_test1 = pd.to_datetime(['2023-01-01', '2023-06-15', '2023-12-31'])
date_test1

DatetimeIndex(['2023-01-01', '2023-06-15', '2023-12-31'], dtype='datetime64[ns]', freq=None)

In [342]:
date_test1.to_series().diff()

2023-01-01        NaT
2023-06-15   165 days
2023-12-31   199 days
dtype: timedelta64[ns]

In [364]:
df_dates = pd.DataFrame(index=date_test1, columns=['Day', 'Month', 'Year'])
df_dates.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 3 entries, 2023-01-01 to 2023-12-31
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Day     0 non-null      object
 1   Month   0 non-null      object
 2   Year    0 non-null      object
dtypes: object(3)
memory usage: 96.0+ bytes

In [372]:
df_dates['Day'] = date_test1.day_name()
df_dates['Month'] = date_test1.month_name()
df_dates['Year'] = date_test1.year

In [374]:
df_dates

                 Day     Month  Year
2023-01-01    Sunday   January  2023
2023-06-15  Thursday      June  2023
2023-12-31    Sunday  December  2023

In [377]:
start_date = df_dates.index.min()
end_date = df_dates.index.max()

In [378]:
new_dates = pd.date_range(start=start_date, end=end_date, freq='d')
new_dates

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08',
               '2023-01-09', '2023-01-10',
               ...
               '2023-12-22', '2023-12-23', '2023-12-24', '2023-12-25',
               '2023-12-26', '2023-12-27', '2023-12-28', '2023-12-29',
               '2023-12-30', '2023-12-31'],
              dtype='datetime64[ns]', length=365, freq='D')

In [385]:
df_dates = df_dates.reindex(new_dates)

In [389]:
df_dates['Day'] = new_dates.day_name()
df_dates['Month'] = new_dates.month_name()
df_dates['Year'] = new_dates.year

In [391]:
df_dates

                  Day     Month  Year
2023-01-01     Sunday   January  2023
2023-01-02     Monday   January  2023
2023-01-03    Tuesday   January  2023
2023-01-04  Wednesday   January  2023
2023-01-05   Thursday   January  2023
...               ...       ...   ...
2023-12-27  Wednesday  December  2023
2023-12-28   Thursday  December  2023
2023-12-29     Friday  December  2023
2023-12-30   Saturday  December  2023
2023-12-31     Sunday  December  2023

[365 rows x 3 columns]

In [393]:
df_dates.to_period('d')
df_dates.index

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08',
               '2023-01-09', '2023-01-10',
               ...
               '2023-12-22', '2023-12-23', '2023-12-24', '2023-12-25',
               '2023-12-26', '2023-12-27', '2023-12-28', '2023-12-29',
               '2023-12-30', '2023-12-31'],
              dtype='datetime64[ns]', length=365, freq='D')